Class exercise Select

   1. Use the ex1 table on the mysql_notebooks server
   2. Select only those customers with less than $3000 on the account

In [1]:
import sqlalchemy as s_a

# for password with special chars we need url encoding: import urllib.parse; urllib.parse.quote_plus("somestrangepasswordkx%jj5/g"); # will return the encoded password to put in the connectionsstring

# dialect+driver://username:password@host:port/database
SQLALCHEMY_DATABASE_URL = "mysql+mysqlconnector://root:root@db/db"
engine = s_a.create_engine(SQLALCHEMY_DATABASE_URL)
connection = engine.connect()
query = 'select * from ex1 where account < 3000'
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
display(ResultSet)

[(1, 'Freddy M', 'Hallway 22, 34322 moral county', 1000.0, datetime.datetime(2002, 2, 3, 23, 0)),
 (2, 'Janice F', 'Hallway 24, 34322 moral county', 2000.0, datetime.datetime(2001, 2, 4, 23, 0)),
 (4, 'Freddy MÃ¥lÃ¸v', 'Hallway 22, 34322 moral county', 1000.0, datetime.datetime(2002, 2, 3, 23, 0))]

create a pandas dataframe from below csv and turn it into a mysql table called: 'cars'

```csv
make,model,year,price
vw,up,2018,123000
audi,a6,2011,85000
citroen,c3,2019,143000
```

In [7]:
import pandas as pd
from sqlalchemy import create_engine

df = pd.read_csv('cars.csv')
con_str = "mysql+mysqlconnector://root:root@db/db"
engine = create_engine(con_str)
display(df)
df = df.applymap(str)
df.to_sql('cars',con=engine, if_exists='append', index = False)
df

      make model  year   price
0       vw    up  2018  123000
1     audi    a6  2011   85000
2  citroen    c3  2019  143000

      make model  year   price
0       vw    up  2018  123000
1     audi    a6  2011   85000
2  citroen    c3  2019  143000